codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl020.h
#define _AD1HIT_CHH3_POSITION                    0x00000003
#define _AD1HIT_CHH3_MASK                        0x00000008
#define _AD1HIT_CHH3_LENGTH                      0x00000001

#define _AD1HIT_CHH4_POSITION                    0x00000004
#define _AD1HIT_CHH4_MASK                        0x00000010
#define _AD1HIT_CHH4_LENGTH                      0x00000001

#define _AD1HIT_CHH5_POSITION                    0x00000005
#define _AD1HIT_CHH5_MASK                        0x00000020
#define _AD1HIT_CHH5_LENGTH                      0x00000001

#define _AD1HIT_CHH6_POSITION                    0x00000006
#define _AD1HIT_CHH6_MASK                        0x00000040
#define _AD1HIT_CHH6_LENGTH                      0x00000001

#define _AD1HIT_CHH7_POSITION                    0x00000007
#define _AD1HIT_CHH7_MASK                        0x00000080
#define _AD1HIT_CHH7_LENGTH                      0x00000001

#define _AD1HIT_CHH8_POSITION                    0x00000008
#define _AD1HIT_CHH8_MASK                        0x00000100
#define _AD1HIT_CHH8_LENGTH                      0x00000001

#define _AD1HIT_CHH9_POSITION                    0x00000009
#define _AD1HIT_CHH9_MASK                        0x00000200
#define _AD1HIT_CHH9_LENGTH                      0x00000001

#define _AD1HIT_CHH10_POSITION                   0x0000000A
#define _AD1HIT_CHH10_MASK                       0x00000400
#define _AD1HIT_CHH10_LENGTH                     0x00000001

#define _AD1HIT_CHH11_POSITION                   0x0000000B
#define _AD1HIT_CHH11_MASK                       0x00000800
#define _AD1HIT_CHH11_LENGTH                     0x00000001

#define _AD1HIT_CHH12_POSITION                   0x0000000C
#define _AD1HIT_CHH12_MASK                       0x00001000
#define _AD1HIT_CHH12_LENGTH                     0x00000001

#define _AD1HIT_CHH13_POSITION                   0x0000000D
#define _AD1HIT_CHH13_MASK                       0x00002000
#define _AD1HIT_CHH13_LENGTH                     0x00000001

#define _AD1HIT_CHH14_POSITION                   0x0000000E
#define _AD1HIT_CHH14_MASK                       0x00004000
#define _AD1HIT_CHH14_LENGTH                     0x00000001

#define _AD1HIT_CHH15_POSITION                   0x0000000F
#define _AD1HIT_CHH15_MASK                       0x00008000
#define _AD1HIT_CHH15_LENGTH                     0x00000001

#define _AD1HIT_w_POSITION                       0x00000000
#define _AD1HIT_w_MASK                           0xFFFFFFFF
#define _AD1HIT_w_LENGTH                         0x00000020

#define _CMSTAT_C1OUT_POSITION                   0x00000000
#define _CMSTAT_C1OUT_MASK                       0x00000001
#define _CMSTAT_C1OUT_LENGTH                     0x00000001

#define _CMSTAT_C2OUT_POSITION                   0x00000001
#define _CMSTAT_C2OUT_MASK                       0x00000002
#define _CMSTAT_C2OUT_LENGTH                     0x00000001

#define _CMSTAT_CVREFSEL_POSITION                0x00000008
#define _CMSTAT_CVREFSEL_MASK                    0x00000100
#define _CMSTAT_CVREFSEL_LENGTH                  0x00000001

#define _CMSTAT_SIDL_POSITION                    0x0000000D
#define _CMSTAT_SIDL_MASK                        0x00002000
#define _CMSTAT_SIDL_LENGTH                      0x00000001

#define _CMSTAT_C1EVT_POSITION                   0x00000010
#define _CMSTAT_C1EVT_MASK                       0x00010000
#define _CMSTAT_C1EVT_LENGTH                     0x00000001

#define _CMSTAT_C2EVT_POSITION                   0x00000011
#define _CMSTAT_C2EVT_MASK                       0x00020000
#define _CMSTAT_C2EVT_LENGTH                     0x00000001

#define _CM1CON_CCH_POSITION                     0x00000000
#define _CM1CON_CCH_MASK                         0x00000003
#define _CM1CON_CCH_LENGTH                       0x00000002

#define _CM1CON_CREF_POSITION                    0x00000004
#define _CM1CON_CREF_MASK                        0x00000010
#define _CM1CON_CREF_LENGTH                      0x00000001

#define _CM1CON_EVPOL_POSITION                   0x00000006
#define _CM1CON_EVPOL_MASK                       0x000000C0
#define _CM1CON_EVPOL_LENGTH                     0x00000002

#define _CM1CON_COUT_POSITION                    0x00000008
#define _CM1CON_COUT_MASK                        0x00000100
#define _CM1CON_COUT_LENGTH                      0x00000001

#define _CM1CON_CEVT_POSITION                    0x00000009
#define _CM1CON_CEVT_MASK                        0x00000200
#define _CM1CON_CEVT_LENGTH                      0x00000001

#define _CM1CON_CPOL_POSITION                    0x0000000D
#define _CM1CON_CPOL_MASK                        0x00002000
#define _CM1CON_CPOL_LENGTH                      0x00000001

#define _CM1CON_COE_POSITION                     0x0000000E
#define _CM1CON_COE_MASK                         0x00004000
#define _CM1CON_COE_LENGTH                       0x00000001

#define _CM1CON_ON_POSITION                      0x0000000F
#define _CM1CON_ON_MASK                          0x00008000
#define _CM1CON_ON_LENGTH                        0x00000001

#define _CM2CON_CCH_POSITION                     0x00000000
#define _CM2CON_CCH_MASK                         0x00000003
#define _CM2CON_CCH_LENGTH                       0x00000002

#define _CM2CON_CREF_POSITION                    0x00000004
#define _CM2CON_CREF_MASK                        0x00000010
#define _CM2CON_CREF_LENGTH                      0x00000001

#define _CM2CON_EVPOL_POSITION                   0x00000006
#define _CM2CON_EVPOL_MASK                       0x000000C0
#define _CM2CON_EVPOL_LENGTH                     0x00000002

#define _CM2CON_COUT_POSITION                    0x00000008
#define _CM2CON_COUT_MASK                        0x00000100
#define _CM2CON_COUT_LENGTH                      0x00000001

#define _CM2CON_CEVT_POSITION                    0x00000009
#define _CM2CON_CEVT_MASK                        0x00000200
#define _CM2CON_CEVT_LENGTH                      0x00000001

#define _CM2CON_CPOL_POSITION                    0x0000000D
#define _CM2CON_CPOL_MASK                        0x00002000
#define _CM2CON_CPOL_LENGTH                      0x00000001

#define _CM2CON_COE_POSITION                     0x0000000E
#define _CM2CON_COE_MASK                         0x00004000
#define _CM2CON_COE_LENGTH                       0x00000001

#define _CM2CON_ON_POSITION                      0x0000000F
#define _CM2CON_ON_MASK                          0x00008000
#define _CM2CON_ON_LENGTH                        0x00000001

#define _VR1CON_REFSEL_POSITION                  0x00000000
#define _VR1CON_REFSEL_MASK                      0x00000003
#define _VR1CON_REFSEL_LENGTH                    0x00000002

#define _VR1CON_VROE_POSITION                    0x00000008
#define _VR1CON_VROE_MASK                        0x00000100
#define _VR1CON_VROE_LENGTH                      0x00000001

