codebndr/arduino-core-files/v167/hardware/chipKIT/pic32/compiler/pic32-tools/pic32mx/include/proc/p32mm0064gpl020.h
#define _CLC1GLS_G1D4N_POSITION                  0x00000006
#define _CLC1GLS_G1D4N_MASK                      0x00000040
#define _CLC1GLS_G1D4N_LENGTH                    0x00000001

#define _CLC1GLS_G1D4T_POSITION                  0x00000007
#define _CLC1GLS_G1D4T_MASK                      0x00000080
#define _CLC1GLS_G1D4T_LENGTH                    0x00000001

#define _CLC1GLS_G2D1N_POSITION                  0x00000008
#define _CLC1GLS_G2D1N_MASK                      0x00000100
#define _CLC1GLS_G2D1N_LENGTH                    0x00000001

#define _CLC1GLS_G2D1T_POSITION                  0x00000009
#define _CLC1GLS_G2D1T_MASK                      0x00000200
#define _CLC1GLS_G2D1T_LENGTH                    0x00000001

#define _CLC1GLS_G2D2N_POSITION                  0x0000000A
#define _CLC1GLS_G2D2N_MASK                      0x00000400
#define _CLC1GLS_G2D2N_LENGTH                    0x00000001

#define _CLC1GLS_G2D2T_POSITION                  0x0000000B
#define _CLC1GLS_G2D2T_MASK                      0x00000800
#define _CLC1GLS_G2D2T_LENGTH                    0x00000001

#define _CLC1GLS_G2D3N_POSITION                  0x0000000C
#define _CLC1GLS_G2D3N_MASK                      0x00001000
#define _CLC1GLS_G2D3N_LENGTH                    0x00000001

#define _CLC1GLS_G2D3T_POSITION                  0x0000000D
#define _CLC1GLS_G2D3T_MASK                      0x00002000
#define _CLC1GLS_G2D3T_LENGTH                    0x00000001

#define _CLC1GLS_G2D4N_POSITION                  0x0000000E
#define _CLC1GLS_G2D4N_MASK                      0x00004000
#define _CLC1GLS_G2D4N_LENGTH                    0x00000001

#define _CLC1GLS_G2D4T_POSITION                  0x0000000F
#define _CLC1GLS_G2D4T_MASK                      0x00008000
#define _CLC1GLS_G2D4T_LENGTH                    0x00000001

#define _CLC1GLS_G3D1N_POSITION                  0x00000010
#define _CLC1GLS_G3D1N_MASK                      0x00010000
#define _CLC1GLS_G3D1N_LENGTH                    0x00000001

#define _CLC1GLS_G3D1T_POSITION                  0x00000011
#define _CLC1GLS_G3D1T_MASK                      0x00020000
#define _CLC1GLS_G3D1T_LENGTH                    0x00000001

#define _CLC1GLS_G3D2N_POSITION                  0x00000012
#define _CLC1GLS_G3D2N_MASK                      0x00040000
#define _CLC1GLS_G3D2N_LENGTH                    0x00000001

#define _CLC1GLS_G3D2T_POSITION                  0x00000013
#define _CLC1GLS_G3D2T_MASK                      0x00080000
#define _CLC1GLS_G3D2T_LENGTH                    0x00000001

#define _CLC1GLS_G3D3N_POSITION                  0x00000014
#define _CLC1GLS_G3D3N_MASK                      0x00100000
#define _CLC1GLS_G3D3N_LENGTH                    0x00000001

#define _CLC1GLS_G3D3T_POSITION                  0x00000015
#define _CLC1GLS_G3D3T_MASK                      0x00200000
#define _CLC1GLS_G3D3T_LENGTH                    0x00000001

#define _CLC1GLS_G3D4N_POSITION                  0x00000016
#define _CLC1GLS_G3D4N_MASK                      0x00400000
#define _CLC1GLS_G3D4N_LENGTH                    0x00000001

#define _CLC1GLS_G3D4T_POSITION                  0x00000017
#define _CLC1GLS_G3D4T_MASK                      0x00800000
#define _CLC1GLS_G3D4T_LENGTH                    0x00000001

#define _CLC1GLS_G4D1N_POSITION                  0x00000018
#define _CLC1GLS_G4D1N_MASK                      0x01000000
#define _CLC1GLS_G4D1N_LENGTH                    0x00000001

#define _CLC1GLS_G4D1T_POSITION                  0x00000019
#define _CLC1GLS_G4D1T_MASK                      0x02000000
#define _CLC1GLS_G4D1T_LENGTH                    0x00000001

#define _CLC1GLS_G4D2N_POSITION                  0x0000001A
#define _CLC1GLS_G4D2N_MASK                      0x04000000
#define _CLC1GLS_G4D2N_LENGTH                    0x00000001

#define _CLC1GLS_G4D2T_POSITION                  0x0000001B
#define _CLC1GLS_G4D2T_MASK                      0x08000000
#define _CLC1GLS_G4D2T_LENGTH                    0x00000001

#define _CLC1GLS_G4D3N_POSITION                  0x0000001C
#define _CLC1GLS_G4D3N_MASK                      0x10000000
#define _CLC1GLS_G4D3N_LENGTH                    0x00000001

#define _CLC1GLS_G4D3T_POSITION                  0x0000001D
#define _CLC1GLS_G4D3T_MASK                      0x20000000
#define _CLC1GLS_G4D3T_LENGTH                    0x00000001

#define _CLC1GLS_G4D4N_POSITION                  0x0000001E
#define _CLC1GLS_G4D4N_MASK                      0x40000000
#define _CLC1GLS_G4D4N_LENGTH                    0x00000001

#define _CLC1GLS_G4D4T_POSITION                  0x0000001F
#define _CLC1GLS_G4D4T_MASK                      0x80000000
#define _CLC1GLS_G4D4T_LENGTH                    0x00000001

#define _CLC1GLS_w_POSITION                      0x00000000
#define _CLC1GLS_w_MASK                          0xFFFFFFFF
#define _CLC1GLS_w_LENGTH                        0x00000020

#define _CLC2CON_MODE_POSITION                   0x00000000
#define _CLC2CON_MODE_MASK                       0x00000007
#define _CLC2CON_MODE_LENGTH                     0x00000003

#define _CLC2CON_LCPOL_POSITION                  0x00000005
#define _CLC2CON_LCPOL_MASK                      0x00000020
#define _CLC2CON_LCPOL_LENGTH                    0x00000001

#define _CLC2CON_LCOUT_POSITION                  0x00000006
#define _CLC2CON_LCOUT_MASK                      0x00000040
#define _CLC2CON_LCOUT_LENGTH                    0x00000001

#define _CLC2CON_LCOE_POSITION                   0x00000007
#define _CLC2CON_LCOE_MASK                       0x00000080
#define _CLC2CON_LCOE_LENGTH                     0x00000001

#define _CLC2CON_INTN_POSITION                   0x0000000A
#define _CLC2CON_INTN_MASK                       0x00000400
#define _CLC2CON_INTN_LENGTH                     0x00000001

#define _CLC2CON_INTP_POSITION                   0x0000000B
#define _CLC2CON_INTP_MASK                       0x00000800
#define _CLC2CON_INTP_LENGTH                     0x00000001

#define _CLC2CON_SIDL_POSITION                   0x0000000D
#define _CLC2CON_SIDL_MASK                       0x00002000
#define _CLC2CON_SIDL_LENGTH                     0x00000001

